app/controllers/sessions_controller.rb

	def create
		#complete this method
		user = User.find_by_email(user_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "espe@esperanza.cl"], ["LIMIT", 1]]